{
  "timestamp": "2025-11-11T10:25:53.027Z",
  "projects": [
    {
      "id": "qatar",
      "title": "Qatar Airways",
      "category": "AI & Aviation",
      "thumbnail": "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/fcd92120-ce79-4407-9176-3cf0b7fb5de2/phone_animation_compressed-ezgif.com-optimize.gif?format=2500w",
      "images": [
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/fcd92120-ce79-4407-9176-3cf0b7fb5de2/phone_animation_compressed-ezgif.com-optimize.gif?format=2500w",
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/1b8df5a0-d737-45c7-966f-5870b0d4a085/topicbubblesgif-ezgif.com-optimize.gif?format=2500w",
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/d41d49a8-3e8a-423e-ad62-856f50d0615d/light+version+gif.gif?format=2500w",
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/81293208-0aad-493b-9c91-ef2dddf15119/qatarphone.webp?format=2500w"
      ],
      "description": "A project to introduce real-time AI agent to manage bookings, select seat and much more.",
      "year": "2025",
      "client": "Qatar Airways",
      "role": "Lead Product Designer",
      "history": [
        {
          "phase": "Real-time AI Agents",
          "content": "Introduced real-time streaming AI avatars that also visualise information as they speak. As you're conversing with the agent it present information / options as floating components, allowing you to guide the conversation by clicking on elements. You can also follow up with a chat message or via voice. The goal is to replace traditional chat based LLM information architecture with something more visual similar to a presentation generated in real-time. This project was an accumulation of my research on real-time streaming avatars.",
          "images": [
            {
              "url": "",
              "caption": "The desktop version with the real-time streaming avatar"
            }
          ]
        },
        {
          "phase": "Mobile Experience",
          "content": "On mobile, apart from the real-time agent you're also presented with quick-start options allowing you to book a flight, select a seat or configure your on-board meal preferences. You can also use this interface during flight via the on-flight Wifi.",
          "images": [
            {
              "url": ""
            },
            {
              "url": ""
            }
          ]
        }
      ]
    },
    {
      "id": "mytaverse",
      "title": "Mytaverse",
      "category": "B2B Metaverse Platform",
      "thumbnail": "indexeddb:mytaverse-thumbnail",
      "images": [
        "https://framerusercontent.com/images/kDxWvpQMfLKqHPCKLfNmXEJGQk.png",
        "https://framerusercontent.com/images/9LxWvpQMfLKqHPCKLfNmXEJGQk.png",
        "https://framerusercontent.com/images/2MxWvpQMfLKqHPCKLfNmXEJGQk.png"
      ],
      "description": "Complete redesign of a B2B metaverse platform for virtual events and collaboration.",
      "year": "2024",
      "client": "Mytaverse",
      "role": "Lead Product Designer",
      "history": [
        {
          "phase": "Getting Started",
          "content": "Joined the team after their initial launch, they were trying to figure out product-market fit, how people were utilising the platform and how to get them onboarded.",
          "images": [
            {
              "url": "",
              "caption": "Different use cases for the enterprise metaverse"
            }
          ]
        },
        {
          "phase": "__TEXT__",
          "content": "To learn more, I’ve conducted 12 interviews with existing users and virtual field studies with 6 group of users entering the world for the first time. The finding were as follows:"
        },
        {
          "phase": "__TEXT__",
          "content": "9 / 12  - Wanted to use their world to promote and sell some kind of product or service\n5 / 12  - Were having problems with controlling their avatar\n4 / 12  - Had issues connecting to the audio channel\n4 / 12  - Had problems with navigating the world\n2 / 12  - Had connection issues"
        },
        {
          "phase": "__TEXT__",
          "content": "The majority of our users it seems were utilising the metaverse for commercial use cases. "
        },
        {
          "phase": "__IMAGE__",
          "content": "",
          "images": [
            {
              "url": ""
            }
          ]
        },
        {
          "phase": "__IMAGE__",
          "content": "",
          "images": [
            {
              "url": "",
              "caption": "Sketches from the design sprint diverge stage on different layouts"
            }
          ]
        },
        {
          "phase": "__TEXT__",
          "content": "To come up with the new UI I’ve organised a three day design sprint that involved development and the executive team. The goal was to understand what our users wanted and what were the structural issues that got in the way. In the end we created two options for additional validation."
        },
        {
          "phase": "__IMAGE__",
          "content": "",
          "images": [
            {
              "url": "",
              "caption": "Option A was a traditional layout familiar from video conferencing solutions"
            }
          ]
        },
        {
          "phase": "__IMAGE__",
          "content": "",
          "images": [
            {
              "url": "",
              "caption": "Option B was what we called a ‘bubble style’ layout with horizontal orientation on mobile."
            }
          ]
        },
        {
          "phase": "__TEXT__",
          "content": "To decide on the viable option 6 users were interviewed and tested on prototypes, 3 on option A and 3 on option B. Since users were having issues with the transparent bar obscuring the view and they preferred the horizontal layout we decided to continue with the ‘bubble style’ version."
        },
        {
          "phase": "__DIVIDER__",
          "content": ""
        },
        {
          "phase": "Onboarding",
          "content": "Many users were not familiar with video game controls and we had several initiatives to combat this. The initial onboarding took place in a virtual lobby area where users could try out controls on their own while waiting for the game to load.",
          "images": [
            {
              "url": ""
            }
          ]
        },
        {
          "phase": "__TEXT__",
          "content": "Another initiative was the addition of a helpful bot that users could invoke at any time by speech or text. The bot ‘S.A.R.A’ (Sentient, Autonomous, Robot, Aid) would provide helpful instructions from the knowledge base with vocal answers using an AI generated voice."
        },
        {
          "phase": "__IMAGE__",
          "content": "",
          "images": [
            {
              "url": ""
            }
          ]
        },
        {
          "phase": "__DIVIDER__",
          "content": ""
        },
        {
          "phase": "Login Experience\n",
          "content": "Most or our clients wanted a world they can call their own. This meant custom avatar skins, brand colors and assets across the interface and the 3D environments. We also split tested variations on what kind of login interfaces clients wanted and with what login options were available.",
          "images": [
            {
              "url": "",
              "caption": "Wireframe for the non-branded login page"
            },
            {
              "url": "",
              "caption": "Character selection screen"
            },
            {
              "url": "",
              "caption": "Branded login for Aldar"
            }
          ]
        },
        {
          "phase": "__DIVIDER__",
          "content": ""
        },
        {
          "phase": "Video Conferencing\n",
          "content": "The addition of video conferencing was a huge milestone for the project. We wanted to design something that incorporates the feeling of being in a three dimensional environment. The ideas was to show participants based on the rotation and distance from the user’s avatar. As the user changes the view and starts moving the videos would rotate as well, similar to a compass.",
          "images": [
            {
              "url": ""
            }
          ]
        },
        {
          "phase": "__DIVIDER__",
          "content": ""
        },
        {
          "phase": "Admin Panel",
          "content": "Creating worlds took us hours as each one had to be set up by one of our admins. We wanted to speed that up and let users set up the basics with the introduction of modular worlds with interchangeable facilities and rooms.",
          "images": [
            {
              "url": ""
            },
            {
              "url": ""
            }
          ]
        }
      ]
    },
    {
      "id": "colossyan",
      "title": "Colossyan",
      "category": "AI Avatar Editor",
      "thumbnail": "indexeddb:colossyan-thumbnail",
      "images": [
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/2d407a87-fd66-4f36-bff7-b86a2034e9a8/Screenshot+2025-06-04+at+17.58.39.png",
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/196de747-43e2-4405-8467-a373091ad634/bubblesgif.gif",
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/79fffa27-b027-4950-ac84-2c82f39331bc/presentercolossyangif-ezgif.com-optimize.gif",
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/3508efae-ad10-402a-bfd8-2a71cc34a506/doc2videogif.gif",
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/fc7e9bae-b9d0-4fdb-b5d0-4a3fd0ea622e/instantvideogif.gif",
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/a83695f3-9b96-409f-b8ce-bff0301c4e27/templatechoosergif.gif",
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/9055b258-3fc6-4592-be9d-e34fea9e1e00/loadinggif.gif",
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/7ee3c2f5-6cb3-4176-a969-5e2b7affc51b/experiments.png",
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/1ddd3d4a-a8f6-4237-b3f0-87c29585ee31/colossyanfinalgif.gif",
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/60003509-c7fb-4f90-a780-c0c56bb5cff6/colossyangif.gif",
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/a0fb7cc6-0dc4-4190-a836-98e405885e6c/colossyanavatarspagegif.gif",
        "https://images.squarespace-cdn.com/content/v1/561dfdd7e4b0be4652489649/cb12a5c5-ed87-42c6-809a-f4b299ce8b2f/croppinggif.gif"
      ],
      "description": "An AI avatar editor allowing you to create interactive experiences",
      "year": "2024",
      "client": "Colossyan",
      "role": "Lead Product Designer",
      "history": [
        {
          "phase": "Real-time Conversational Avatars with Interactive Visuals",
          "content": "At Colossyan I'm leading a new product initiative (greenlit after presenting my market research and product pitch to the CEO) that involves real-time lifelike AI avatars that can visualise information as they speak. Essentially real-time presentation generation. This new product gives a personal touch to the LLM as you no longer have to communicate with AI models via chat messages, there's a face now to the model and it can show information naturally just like a person would present it. This has the potential to disrupt fields like search, teaching, marketing and sales enablement and many more."
        },
        {
          "phase": "How it works",
          "content": "In the background there's the real-time stream of the realistic AI avatar that is combined with a web canvas on top of it. This web canvas can visualise information using pre-created web components like lists, topic, images with title and description, links and charts. They can be interactive as well enabling you to click on the topic you want to hear more about, or visit the link that was presented.",
          "images": [
            {
              "url": "",
              "caption": "The architecture of the real-time streaming avatar"
            }
          ]
        },
        {
          "phase": "Process",
          "content": "Interactive information bubbles are presented around the presenter. List are visualised side-by-side and notice how the presenter moves to the side (in real-time) to make room for the content. The contents of the list items (title, description and image) and the presenter's speech is generated by an AI model (LLM) in real-time."
        },
        {
          "phase": "__TEXT__",
          "content": "Apart from coming up with the initial product pitch the most exciting part of the project was understanding how information is visualised when there's a 'human' presenter involved. Topics for example are presented around the presenter in circular bubbles where bubbles can also go partially behind the presenter (without obstructing or hiding information) emphasising that they are situated in space. They can also be clicked allowing you to advance the conversation and have wobble physics so they gently move as you move your cursor over them. This makes information a living and interactive part of the whole experience."
        },
        {
          "phase": "__IMAGE__",
          "content": "",
          "images": [
            {
              "url": "",
              "caption": "Interactive information bubbles presented around the presenter"
            }
          ]
        },
        {
          "phase": "__TEXT__",
          "content": "List are visualised side-by-side and notice how the presenter moves to the side (in real-time) to make room for the content. The contents of the list items (title, description and image) and the presenter’s speech is generated by an AI model (LLM) in real-time."
        },
        {
          "phase": "__IMAGE__",
          "content": "",
          "images": [
            {
              "url": "",
              "caption": "List are visualised side-by-side. Notice how the AI presenter moved to the side (in real-time) to make room for the content."
            }
          ]
        },
        {
          "phase": "__DIVIDER__",
          "content": ""
        },
        {
          "phase": "AI Video Creator",
          "content": "This was a project that enabled users to create videos using AI. Users can prompt the LLM on what video to create or upload a document as the source material. They can also add interactive elements like quizzes and branching navigation.",
          "images": [
            {
              "url": "",
              "caption": "The final outcome of the project enabling you to upload or prompt to create your ideal video"
            }
          ]
        },
        {
          "phase": "First Iteration",
          "content": "The initial idea was to combine all of the different types of video creation into one interface. You could start by uploading a file, prompting the LLM, or by writing an exact script. After a round of user tests we realised that this kind of segmentation complicated things as users struggled to find the correct tab for their use case.",
          "images": [
            {
              "url": "",
              "caption": "The initial prototype we tested"
            }
          ]
        },
        {
          "phase": "Template Chooser & Loading Experience",
          "content": "Another part of the project was improving what comes after the user specified what kind of video they want to create. The next step in the user journey was choosing a template that would define the look of the video. For this part I reworked the template selector and introduced sorting options by identifying the most important characteristics users were looking by looking at our data metrics. After that there was a fairly long loading process, to make this step more engaging I created a tips & tricks slideshow that would surface useful hints in video format while the user was waiting. Here the tips shown were selected based on what brings the most user value towards our activation metric.",
          "images": [
            {
              "url": "",
              "caption": "The reworked template chooser"
            },
            {
              "url": "",
              "caption": "The loading screen in action"
            }
          ]
        },
        {
          "phase": "Video Creation Experiments",
          "content": "I've also experimented with a more through rework for the video creation process where instead of templates users were able to define the visual look of the video by setting up different parameters such as the avatar presenting, fonts used and the color palette. The outcome of their choices would be visualised immediately on the right side, giving them a real-time preview. This project was unfortunately scope cut but hopefully will be implemented on a later date.",
          "images": [
            {
              "url": ""
            }
          ]
        },
        {
          "phase": "__DIVIDER__",
          "content": ""
        },
        {
          "phase": "Interactive Element Customization",
          "content": "This was a project that enabled you to style interactive components such as branching and quizzes to your liking. It was especially important to comply to brand guidelines so each customer could style them to match their own corporate look. Since our users are not designers I set out to simplify the styling process to the absolute maximum possible by coming up with automation rules that figure out the necessary details.",
          "images": [
            {
              "url": "",
              "caption": "The final outcome of the project with just a few settings you can customise your interactive component."
            }
          ]
        },
        {
          "phase": "Customization Process",
          "content": "When first starting the project I was under the (later turned out to be) false impression that users wanted to have detailed customization options. So I created an accordion style layout where users could click on any element on the canvas an set up its look in every possible way. Upon user testing this solution and user intel coming in from corporate clients we realised that we needed something much simpler as the only thing that mattered is to apply the brand kit and quickly if possible. Unfortunately this information only came at a later date but I learned a lot from this initial prototype. It made me realise how quickly this feature can get complicated and what parts should and could be automated.",
          "images": [
            {
              "url": "",
              "caption": "The accordion style layout with detailed customization options."
            }
          ]
        },
        {
          "phase": "__TEXT__",
          "content": "After this prototype I set out to define the most important characteristics that define a brand look and wrote a detailed documentation on how to automate this process. By defining two types of fonts and three types of colors the whole componet can be styled. Hover states are automatically calculated based on the base color and more neat tricks. I also introduced a smart apply button that did all of this in one click by identifying what colors worked the best for the background and CTA color. I also coded this prototype to show how this logic works in action: https://button-generator-2.vercel.app/"
        },
        {
          "phase": "__DIVIDER__",
          "content": ""
        },
        {
          "phase": "Avatar Page",
          "content": "A project to redesign the avatar library page on the home dashboard. The goal was to have easily hideable filtering options.",
          "images": [
            {
              "url": ""
            }
          ]
        },
        {
          "phase": "Creating Your Own Avatar",
          "content": "This was a project to let users create an avatar based on themselves.",
          "images": [
            {
              "url": ""
            }
          ]
        }
      ]
    },
    {
      "id": "prezi",
      "title": "Prezi",
      "category": "Presentation Editor",
      "thumbnail": "indexeddb:prezi-thumbnail",
      "images": [
        "https://framerusercontent.com/images/1QxWvpQMfLKqHPCKLfNmXEJGQk.png",
        "https://framerusercontent.com/images/5RxWvpQMfLKqHPCKLfNmXEJGQk.png",
        "https://framerusercontent.com/images/8SxWvpQMfLKqHPCKLfNmXEJGQk.png"
      ],
      "description": "Designed new features for Prezi's presentation editor, focusing on improving the creation and collaboration experience.",
      "year": "2023",
      "client": "Prezi",
      "role": "Senior Product Designer",
      "history": [
        {
          "phase": "Feature Design",
          "content": "Designed new features for Prezi's presentation editor, enhancing the creation workflow and collaboration capabilities for teams."
        }
      ]
    },
    {
      "id": "piktochart",
      "title": "Piktochart",
      "category": "AI Video Editor",
      "thumbnail": "indexeddb:piktochart-thumbnail",
      "images": [
        "https://framerusercontent.com/images/3TxWvpQMfLKqHPCKLfNmXEJGQk.png",
        "https://framerusercontent.com/images/7UxWvpQMfLKqHPCKLfNmXEJGQk.png",
        "https://framerusercontent.com/images/9VxWvpQMfLKqHPCKLfNmXEJGQk.png"
      ],
      "description": "AI-powered video editor (Piktostory) that simplifies video creation and editing for content creators.",
      "year": "2023",
      "client": "Piktochart",
      "role": "Lead Product Designer",
      "history": [
        {
          "phase": "AI Video Editor",
          "content": "Designed Piktostory, an AI-powered video editor that makes video creation accessible to everyone. Focus on automating complex editing tasks while maintaining creative control."
        }
      ]
    },
    {
      "id": "world-press-photo",
      "title": "World Press Photo",
      "category": "Website Redesign",
      "thumbnail": "indexeddb:world-press-photo-thumbnail",
      "images": [
        "https://framerusercontent.com/images/2WxWvpQMfLKqHPCKLfNmXEJGQk.png",
        "https://framerusercontent.com/images/6XxWvpQMfLKqHPCKLfNmXEJGQk.png",
        "https://framerusercontent.com/images/4YxWvpQMfLKqHPCKLfNmXEJGQk.png"
      ],
      "description": "Webby Award-winning website redesign for World Press Photo, showcasing award-winning photojournalism.",
      "year": "2022",
      "client": "World Press Photo",
      "role": "Lead Designer",
      "history": [
        {
          "phase": "Webby Award Winner",
          "content": "Led the website redesign for World Press Photo that won a Webby Award. Created an immersive experience that honors the power of photojournalism and makes the archive accessible to global audiences."
        }
      ]
    },
    {
      "id": "omron",
      "title": "Omron",
      "category": "Medical Device Marketplace",
      "thumbnail": "indexeddb:omron-thumbnail",
      "images": [
        "https://framerusercontent.com/images/1QxWvpQMfLKqHPCKLfNmXEJGQk.png",
        "https://framerusercontent.com/images/5RxWvpQMfLKqHPCKLfNmXEJGQk.png",
        "https://framerusercontent.com/images/8SxWvpQMfLKqHPCKLfNmXEJGQk.png"
      ],
      "description": "E-commerce platform for Omron's medical devices, making healthcare products accessible to consumers.",
      "year": "2022",
      "client": "Omron Healthcare",
      "role": "Product Designer",
      "history": [
        {
          "phase": "Medical Device Marketplace",
          "content": "Designed an e-commerce platform for Omron's medical devices, focusing on building trust and making complex healthcare products easy to understand and purchase."
        }
      ]
    },
    {
      "id": "joinme",
      "title": "Join.me",
      "category": "Video Conferencing",
      "thumbnail": "indexeddb:joinme-thumbnail",
      "images": [
        "https://framerusercontent.com/images/3TxWvpQMfLKqHPCKLfNmXEJGQk.png",
        "https://framerusercontent.com/images/7UxWvpQMfLKqHPCKLfNmXEJGQk.png",
        "https://framerusercontent.com/images/9VxWvpQMfLKqHPCKLfNmXEJGQk.png"
      ],
      "description": "Video conferencing tool designed for seamless remote collaboration and screen sharing.",
      "year": "2021",
      "client": "Join.me",
      "role": "Product Designer",
      "history": [
        {
          "phase": "Video Conferencing Tool",
          "content": "Designed features for Join.me's video conferencing platform, focusing on making remote meetings and screen sharing effortless and reliable."
        }
      ]
    }
  ],
  "about": {
    "content": [
      {
        "id": "1",
        "type": "h1",
        "content": "Hi there!"
      },
      {
        "id": "2",
        "type": "body",
        "content": "I’m a Budapest based Staff Product Designer previously at startups like Join.me & Prezi. Currently at Colossyan where I’m working on the future of video creation with AI avatars.\n"
      },
      {
        "id": "3",
        "type": "body",
        "content": "I’m fascinated by complex, difficult problems that require an interdisciplinary approach. My goal is to help teams and organisations keep moving and improving day-to-day."
      },
      {
        "id": "4",
        "type": "body",
        "content": "Apart from design, enjoy making music, travelling ✌️"
      },
      {
        "id": "5",
        "type": "body",
        "content": "Feel free to DM me if you have any questions or thoughts!"
      }
    ],
    "profileImage": "indexeddb:about-profile-image"
  },
  "home": {
    "title": "Lead Product Designer",
    "subtitle": "Focusing on generative and conversational AI and other emerging technologies."
  }
}